# Core
brew 'fish'
brew 'git'
brew 'gh'
brew 'tree'
brew 'glow'
brew 'unar'           # extracts rar/zip/7z/etc (replaces deprecated `unrar`)

# Languages / runtimes
brew 'go'
brew 'ruby'
brew 'golangci-lint'

# Shell tools
brew 'fzf'           # fuzzy finder (Ctrl+R, Ctrl+T, Alt+C bindings)
brew 'zoxide'        # smarter `cd` — `z <fragment>`
brew 'eza'           # modern `ls` (used by the `ls` alias in fish/config.fish)
brew 'fd'            # modern `find` (indexes fzf pickers — see FZF_*_COMMAND vars)
brew 'bat'           # syntax-highlighted `cat` (fzf preview via FZF_*_OPTS)

# Cloud / deploy
brew 'awscli'
tap  'ngrok/ngrok'
cask 'ngrok'               # ngrok ships as a cask via its own tap
# NOTE: install kamal via `gem install kamal` (not in homebrew)
